tp/software_engineering2017/s/2/B_17_Martin_Datsev/app/controllers/user_subscriptions_controller.rb

  def index
    @user_subscriptions = UserSubscription.all
---
SELECT "user_subscriptions".* FROM "user_subscriptions"

  def create
    @user_subscription = UserSubscription.new(user_subscription_params)

    respond_to do |format|
    	begin
		  if @user_subscription.save
---
INSERT INTO "user_subscriptions" ("user_id", "subscription_id", "role", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["subscription_id", 1], ["role", 1], ["created_at", "2018-04-18 10:40:21.978240"], ["updated_at", "2018-04-18 10:40:21.978240"]]

    def set_user_subscription
      @user_subscription = UserSubscription.find(params[:id])
---
SELECT  "user_subscriptions".* FROM "user_subscriptions" WHERE "user_subscriptions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]